---
type: Gutter
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 3
tags: [revit-api, class]
---

# Gutter

`Autodesk.Revit.DB.Architecture.Gutter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddSegment | — | `public override void AddSegment ( Reference targetRef )` |
| Property | GutterType | — | `public GutterType GutterType { get ; set ; }` |
| Property | Parameter | — | `` |